n5/src/Tasks/UserTask/UserTask.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Task>
  <name>UserTask</name>
  <attributes>
    <name>Action</name>
    <type>
      <types>EnumRef.Actions</types>
    </type>
  </attributes>
  <attributes>
    <name>Appearance</name>
    <type>
      <types>CatalogRef.CalendarAppearance</types>
    </type>
  </attributes>
  <attributes>
    <name>Autocompleted</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Completed</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Creator</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Delegated</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Display</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>150</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Duration</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>25</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Email</name>
    <type>
      <types>DocumentRef.IncomingEmail</types>
      <types>DocumentRef.OutgoingEmail</types>
    </type>
  </attributes>
  <attributes>
    <name>Finish</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Loop</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Mandatory</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Memo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Minutes</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Performer</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Point</name>
    <type>
      <types>EnumRef.CommandPoints</types>
    </type>
  </attributes>
  <attributes>
    <name>Progress</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Reminder</name>
    <type>
      <types>EnumRef.Reminder</types>
    </type>
  </attributes>
  <attributes>
    <name>ReminderDate</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Section</name>
    <type>
      <types>CatalogRef.Sections</types>
    </type>
  </attributes>
  <attributes>
    <name>Source</name>
    <type>
      <types>DefinedType.CommandSources</types>
    </type>
  </attributes>
  <attributes>
    <name>Stage</name>
    <type>
      <types>DefinedType.CommandStages</types>
    </type>
  </attributes>
  <attributes>
    <name>Start</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>Status</name>
    <type>
      <types>CatalogRef.Statuses</types>
    </type>
  </attributes>
  <attributes>
    <name>Task</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Task>

n5/src/Tasks/UserTask/Forms/ExistedTasks/Module.bsl
// *****************************************
// *********** Form events

&AtServer
Procedure OnCreateAtServer ( Cancel, StandardProcessing )
	
	setFilter ();
	
EndProcedure

&AtServer
Procedure setFilter ()
	
	DC.SetFilter ( List, "Source", Parameters.Source );
	
EndProcedure

// *****************************************
// *********** Group Form

&AtClient
Procedure NewTask ( Command )
	
	createTask ();
	
EndProcedure

&AtClient
Procedure createTask ()
	
	callback = new NotifyDescription ( "TaskClosed", ThisObject );
	values = new Structure ( "Source", Parameters.Source );
	OpenForm ( "Task.UserTask.ObjectForm", new Structure ( "FillingValues", values ), ThisObject, , , , callback );
	
EndProcedure

&AtClient
Procedure TaskClosed ( Result, Params ) export
	
	Close ();
	
EndProcedure
